#### BuiltInFailures.MEPSupportFailures Members

---

|  |
| --- |
| BuiltInFailures MEPSupportFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures MEPSupportFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotMatchInstanceSizeToHostError | The instance of [Symbol] cannot be re-sized to match the host. |
| Public property Static member | InstanceOutOfHostError | The instance of [Symbol] lost its host and will be deleted. |
| Public property Static member | InstanceProfileNotMatchWithHostError | The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted. |
| Public property Static member | TypeSizeNotMatchWithHostError | The [Symbol] does not match the size of the host. |

# See Also

BuiltInFailures MEPSupportFailures Class

Autodesk.Revit.DB Namespace